app/controllers/articles_controller.rb

  def index
    @article = Article.all
---
SELECT "articles".* FROM "articles"

  def update
    # @article = Article.find(params[:id])
    if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "dry-----------000"], ["updated_at", "2022-06-29 15:51:11.030357"], ["id", 10]]

  def create
    # to render data as a JSON on browser
    # render plain: params[:article]
    # @article = Artical.new(params[:article])
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "add agter dry"], ["description", "dry-----------"], ["created_at", "2022-06-29 15:39:44.970487"], ["updated_at", "2022-06-29 15:39:44.970487"]]

  def destroy
    # @article = Article.find(params[:id])
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]